var arr_filtr_out=[
    //"Конечный потребитель"
    //,"Юля офис"
    //,"Наташа офис"
    //,"Валерий Владимирович"
    "Ал.Ник."
    ,"Володя кости"
    //,"Таня уб"
    ,"Розничные покупатели"
    ,"Дима Грузчик"
    //,"Таня обвалка"
    //,"Света обвалка"
    //,"Денис Григорьевич"
    //,"Игорь Григорьевич"
    ,"Алла"
    ,"Игорь грузчик"
    //,"Вова грузчик"
    //,"Женя склад"
    //,"Витя водитель"
    //,"Алена Офис"
    //,"Яна "
    ,"Охрана Иван"
    ,"Продажи с точек"
    ,"Ветслужба"
    //,"Лена резчик"
    ,"Инна"
    //,"Димон"
    ,"Руслан водитель"
    //,"Женя грузчик"
    //,"ДИМА"
    //,"Алла 2"
    //,"Артур"
    ,"МАКС"
    ,"Цех Колбаса"
    //,"Виталий Евгеньевич"
    //,"Ира кладовщик"
    ,"Виталик Инвестиции"
    //,"Ира Есина"
    ,"Юра грузчик"
    ,"Жицкий С."
    //,"Лена офис"
    //,"Богун Николай"
    ,"М`яснова (Валки)"
    ,"Рост на Хол горе"
    ,"Торгсервис"
    ,"Тишки"
    ,"Юля уборщица"
    ,"Учредители \"Альяна\""
    ,"Наташа деньги"
    ,"Курбатов"
    ,"Виталик водитель"
    ,"Оптовые продажи"
    //,"Алена резка"
    //,"Оксана кладовщик"
    //,"Олег грузчик"
    //,"Коля 2"
    ,"Ярослав"
    ,"Таня с конного"
    //,"Андрей грузчик"
    ,"Сергей грузчик"
    ,"Артем грузичк"
    ,"Матросова"
    ,"Сергей грузчик 1"
    //,"Алик Солли"
    ,"Серенко Сергей"
    //,"Этуаль"
    //,"Инна админ"
];
var arr_filtr_in=[
    "Склад возвратов"
    , "602-й м-н"
    , "Алексеевка"
    , "Высокий "
    , "Европа"
    , "Залютино"
    , "К1"
    , "К2"
    , "К3"
    , "Киевская"
    , "Комунальная"
    , "Корка"
    , "Круг 2"
    , "Круг 3"
    , "Механизаторская"
    , "Одесская 1"
    , "Одесская 2"
    , "Океан"
    , "Пятихатки"
    , "Пятница"
    , "СА"
    , "Солдат"
    , "Толстого"
    , "Троянда"
    , "Ужвий"
    , "ХТЗ 1"
    , "ХТЗ 2"
    , "Ц1"
    , "Ц2 "
    , "Ц3"
    , "Коротич "
    , "Основной склад СПЕЦИЙ"
    , "Транспорт "
    , "Имущество"
    , "Уборевича"
    , "Любава"
    , "К4"
    , "К5"
    , "К5-курчатко"
    , "Склад на конном"
    , "Черкасская лозовая"
    , "Склад для опта"
    , "СА 2"
    , "Склад компенсация расходов опта"
    , "Ковтуна"
    , "Склад свинины"
    , "Склад возвраты свинины"
    , "Газель Коля 2"
    , "Газель Коля1"
    , "газель витя"
    , "Солли"
    , "Газель №4"
    , "Власенко"
    , "Высокий 2"]

function filter_arrival(in_arr){
    in_arr.filter( function(keyy) {
        for( var ii=0; ii<=filter_in.length; ii++) {
            return ( keyy != filter_in[ii] )
        }
    })
}

function filter_shipment(in_obj){
    var in_arr= Object.values(in_obj.store_catalogue);
    out = in_arr.filter( function(keyy) {
        for( var ii=0; ii<=arr_filtr_out.length; ii++) {
            return ( keyy != arr_filtr_out[ii] )
        }
    })

    //return out;
    return in_obj;



}

//module.exports.filter_in = filter_arrival;
exports.filter_out = filter_shipment;
